000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BasicMath.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 NUM1 PIC 9(1) VALUE 1.
000700 01 NUM2 PIC 9(1) VALUE 2.
000800 01 RESULT PIC 9(1).
000900 01 NUM3 PIC 9(1) VALUE 3.
001000 01 NUM4 PIC 9(1) VALUE 4.
001100 01 RESULT2 PIC 9(2).
001200 
001300 PROCEDURE DIVISION.
001400     ADD NUM1 TO NUM2 GIVING RESULT.
001500     DISPLAY NUM1.
001600     DISPLAY NUM2.
001700     DISPLAY RESULT.
001800     COMPUTE RESULT2 = NUM3 * NUM4
001900     DISPLAY RESULT2.
