000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BasicCondition.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 AGE PIC 99.
000700 01 GRADE PIC 99.
000800 
000900 PROCEDURE DIVISION.
001000     DISPLAY "Enter your age :".
001100     ACCEPT AGE.
001200     
001300     IF AGE >= 18 THEN
001400         DISPLAY "You are an adult"
001500     ELSE
001600         DISPLAY "You are a minor"
001700     END-IF.
001800 
001900     DISPLAY "Enter your grade :".
002000     ACCEPT GRADE.
002100 
002200     EVALUATE TRUE
002300         WHEN GRADE >= 16 DISPLAY "Very well"
002500         WHEN GRADE >= 12 DISPLAY "Good"
002600         WHEN GRADE >= 8  DISPLAY "Meh"
002700         WHEN OTHER DISPLAY "Bad."
002800     END-EVALUATE.
