000100 IDENTIFICATION DIVISION.  *> Informations sur le fichier
000200 PROGRAM-ID. SALUTATION.
000300 
000400 ENVIRONMENT DIVISION.  *> Informations sur l'environnement
000500 *> Vide
000600 
000700 DATA DIVISION. *> Déclaration des variables
000800 WORKING-STORAGE SECTION.
000900 01 USERNAME PIC A(20).
001000 
001100 PROCEDURE DIVISION. *> Logique de l'application
001200     DISPLAY "Enter your name :".
001300     ACCEPT USERNAME.
001400     DISPLAY "Hello, " USERNAME "!".
001500     STOP RUN.
