        IDENTIFICATION DIVISION.           *> Start of script
        PROGRAM-ID. HELLO-WORLD.           *> Script ID
        PROCEDURE DIVISION.                *> Main section
          DISPLAY "Hello, world !".        *> Text printing
          STOP RUN.                        *> End of script
