000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BasicLoop.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 COUNTER PIC 9(2).
000700 01 PWD PIC X(8).
000800 
000900 PROCEDURE DIVISION.
001000     PERFORM VARYING COUNTER FROM 0 BY 1 UNTIL COUNTER > 9
001100         DISPLAY COUNTER
001200     END-PERFORM.
001300 
001400     PERFORM UNTIL PWD = "p4ssw0rd"
001500         DISPLAY "Password?"
001600         ACCEPT PWD
001700    END-PERFORM.
001800    DISPLAY "You found the right password!".
