000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BasicStructure.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 USER-1.
000700    02 NAME PIC A(30) VALUE "JOHN".
000800    02 AGE PIC 99 VALUE "24".
000900    02 EMAIL PIC X(255) VALUE "johndoe@example.com".
001000    
001100 01 USER-2.
001200    02 NAME PIC A(30).
001300    02 AGE PIC 99.
001400    02 EMAIL PIC X(255).
001500    
001600 PROCEDURE DIVISION.
001700   MOVE USER-1 TO USER-2.
001800   DISPLAY EMAIL OF USER-2.
