000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ReadFile.
000300 
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT FILE-USER ASSIGN TO "user.dat"
000800     ORGANIZATION IS SEQUENTIAL.
000900 
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD FILE-USER.
001300 01 USER.
001400    02 NAME PIC A(20).
001500    02 AGE PIC 99.
001600 
001700 WORKING-STORAGE SECTION.
001800 01 END-OF-FILE PIC 9 VALUE 0.
001900 
002000 PROCEDURE DIVISION.
002100     OPEN INPUT FILE-USER.
002200 
002300     DISPLAY "List of users:".
002400 
002500     PERFORM UNTIL END-OF-FILE = 1
002600         READ FILE-USER
002700             AT END MOVE 1 TO END-OF-FILE
002800             NOT AT END DISPLAY "Name: " NAME ", Age: " AGE
002900         END-READ
003000     END-PERFORM.
003100 
003200     CLOSE FILE-USER.
003300     STOP RUN.
