000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. WriteFile.
000300 
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 FILE-CONTROL.
000700     SELECT FILE-USER ASSIGN TO "user.dat"
000800     ORGANIZATION IS SEQUENTIAL.
000900 
001000 DATA DIVISION.
001100 FILE SECTION.
001200 FD FILE-USER.
001300 01 USER.
001400    02 NAME PIC X(20).
001500    02 AGE PIC 99.
001600 
001700 PROCEDURE DIVISION.
001800     OPEN OUTPUT FILE-USER.
001900 
002000     MOVE "JOHN DOE" TO NAME.
002100     MOVE 30 TO AGE.
002200 
002300     WRITE USER.
002400 
002500     CLOSE FILE-USER.
002600     DISPLAY "File created with success".
002700 
002800     STOP RUN.
