000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MainProgram.
000300 
000400 ENVIRONMENT DIVISION.
000500 INPUT-OUTPUT SECTION.
000600 
000700 DATA DIVISION.
000800 WORKING-STORAGE SECTION.
000900 01 EMPLOYEE-ID   PIC 9(5) VALUE 12345.
001000 01 SALARY        PIC 9(5)V99 VALUE 2500.75.
001100 01 ERROR-CODE  PIC 9(1).
001200 
001300 PROCEDURE DIVISION.
001400     CALL "SubProgram" USING EMPLOYEE-ID SALARY ERROR-CODE.
001500     DISPLAY "Exit code " ERROR-CODE.
001600     STOP RUN.
